#ifndef _CRI_ADXF_H_INCLUDED
#define _CRI_ADXF_H_INCLUDED
/****************************************************************************/
/*																			*/
/*			$title$ ï¿½`ï¿½cï¿½wï¿½tï¿½@ï¿½Cï¿½ï¿½ï¿½Vï¿½Xï¿½eï¿½ï¿½ ï¿½ï¿½ï¿½Cï¿½uï¿½ï¿½ï¿½ï¿½						*/
/*				ADXF (ADX File System) Library */
/*																			*/
/*				1998.7.3		written by S.Hosaka
 */
/*																			*/
/****************************************************************************/

/****************************************************************************/
/*      ï¿½Cï¿½ï¿½ï¿½Nï¿½ï¿½ï¿½[ï¿½hï¿½tï¿½@ï¿½Cï¿½ï¿½ */
/*      Include file */
/****************************************************************************/

#include "cri/ee/cri_xpt.h"
#include "sj.h"

/****************************************************************************/
/*		ï¿½è”ï¿½}ï¿½Nï¿½ï¿½
 */
/*		MACRO CONSTANT
 */
/****************************************************************************/

/*	Version number of ADX File System	*/
#define ADXF_VER "6.33"

/*	ï¿½tï¿½@ï¿½Cï¿½ï¿½ï¿½ï¿½ï¿½Ì•ï¿½ï¿½ï¿½ï¿½ï¿½				*/
/*	Maximum number of file name strings	*/
#define ADXF_FNAME_MAX (256)

/*	ï¿½Å‘ï¿½pï¿½[ï¿½eï¿½Bï¿½Vï¿½ï¿½ï¿½ï¿½ï¿½ï¿½				*/
/*	Maximum number of partition			*/
#define ADXF_PART_MAX (256)

/*	ï¿½Å‘ï¿½tï¿½@ï¿½Cï¿½ï¿½ï¿½ï¿½						*/
/*	Maximum number of file				*/
#define ADXF_FILE_MAX (65536)

/*	ADXFï¿½nï¿½ï¿½ï¿½hï¿½ï¿½ï¿½Iï¿½uï¿½Wï¿½Fï¿½Nï¿½gï¿½ÌŒÂï¿½		*/

                                 /*	Sector size in CD-ROM		*/
#ifdef __EE__
#define ADXF_DEF_DMA_ALIGN (64) /*	DMAï¿½ÌƒAï¿½ï¿½ï¿½Cï¿½ï¿½ï¿½ï¿½ï¿½g			*/
                                /*	Alignment of DMA transfer	*/
#define ADXF_DEF_ALIGN_CALC (0xFFFFFFC0)

#else

#define ADXF_DEF_DMA_ALIGN (32) /*	DMAï¿½ÌƒAï¿½ï¿½ï¿½Cï¿½ï¿½ï¿½ï¿½ï¿½g			*/
/*	Alignment of DMA transfer	*/
#define ADXF_DEF_ALIGN_CALC (0xFFFFFFE0)
#endif

#define ADXF_DEF_REQ_RD_SCT (512) /*	ï¿½ï¿½ï¿½[ï¿½hï¿½ï¿½ï¿½Nï¿½Gï¿½Xï¿½gï¿½Tï¿½Cï¿½Y		*/
                                  /*	read request size			*/

/*	ï¿½fï¿½oï¿½bï¿½Oï¿½p	*/
/*	for Debug	*/
// #define	ADXF_CMD_HSTRY_MAX		(256)		/*	ï¿½Rï¿½}ï¿½ï¿½ï¿½hï¿½ï¿½ï¿½ï¿½ï¿½ÌŒÂï¿½
// */
#define ADXF_CMD_HSTRY_MAX (16) /*	ï¿½Rï¿½}ï¿½ï¿½ï¿½hï¿½ï¿½ï¿½ï¿½ï¿½ÌŒÂï¿½			*/
                                /*	Number of command history	*/

#define ADXF_CMD_OPEN (1)      /*	ADXF_Open					*/
#define ADXF_CMD_OPEN_AFS (2)  /*	ADXF_OpenAfs				*/
#define ADXF_CMD_CLOSE (3)     /*	ADXF_Close					*/
#define ADXF_CMD_READ_NW32 (4) /*	ADXF_ReadNw32				*/
#define ADXF_CMD_STOP (5)      /*	ADXF_Stop					*/
#define ADXF_CMD_SEEK (6)      /*	ADXF_Seek					*/
#define ADXF_CMD_STOP_NW (7)   /*	ADXF_StopNw					*/

#define ADXF_CMD_NUM_MAX (16)

/****************************************************************************/
/*		ï¿½ñ‹“’è”
 */
/*		Enumarate Constants
 */
/****************************************************************************/

/****************************************************************************/
/*		ï¿½ï¿½ï¿½ï¿½ï¿½}ï¿½Nï¿½ï¿½
 */
/*		Process MACRO
 */
/****************************************************************************/

/*	ï¿½pï¿½[ï¿½eï¿½Bï¿½Vï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½É•Kï¿½vï¿½È—Ìˆï¿½ÌŒvï¿½Z						*/
/*	Calculation of necessary area for partition information		*/
//	"6"ï¿½ÍAadxf_ptinfoï¿½Ìƒï¿½ï¿½ï¿½ï¿½oï¿½[ï¿½ï¿½(adxf_ptinfo+size+nfile+nentry+type+rev+curdir+ofst)
#define ADXF_PTIF_CMN_SZ ((6 * sizeof(Sint32)) + (ADXF_FNAME_MAX * sizeof(Sint8)))

#define ADXF_CALC_PTINFO_REAL_SIZE(n) (ADXF_PTIF_CMN_SZ + (((n) + 1) * sizeof(Sint16)))

#define ADXF_CALC_PTINFO_SIZE(n) ((ADXF_CALC_PTINFO_REAL_SIZE(n) + sizeof(Sint16)) / 4 * 4)

#define ADXF_CALC_ADD_PTINFO_SIZE(n) (ADXF_PTIF_CMN_SZ + ((n) * (2 * sizeof(Sint16) + sizeof(Sint32))))

/*	ï¿½ï¿½ï¿½[ï¿½hï¿½pï¿½[ï¿½eï¿½Bï¿½Vï¿½ï¿½ï¿½ï¿½ï¿½pï¿½eï¿½ï¿½ï¿½|ï¿½ï¿½ï¿½ï¿½ï¿½oï¿½bï¿½tï¿½@ï¿½ÌƒTï¿½Cï¿½Yï¿½vï¿½Z	*/
/*	Calculation of temporary buffer size for load-partition	*/
#define ADXF_CALC_TMPBUF_SIZE(n) ((((n + 1) * 8) + (ADXF_DEF_SCT_SIZE - 1)) / ADXF_DEF_SCT_SIZE * ADXF_DEF_SCT_SIZE)

/****************************************************************************/
/*		ï¿½fï¿½[ï¿½^ï¿½^
 */
/*      Data type declaration */
/****************************************************************************/

#ifndef ADXSTM_DEFINED
#define ADXSTM_DEFINED
typedef void *ADXSTM;
#endif

/*	ADXFï¿½nï¿½ï¿½ï¿½hï¿½ï¿½		*/
/*	ADXF handle			*/
#ifndef ADXF_DEFINED
#define ADXF_DEFINED
typedef struct _adx_fs {
    Sint8 used;       /* offset 0x0, size 0x1 */ /*	ï¿½gï¿½pï¿½ï¿½ï¿½ï¿½ï¿½Û‚ï¿½						*/
    Sint8 stat;       /* offset 0x1, size 0x1 */ /*	ï¿½nï¿½ï¿½ï¿½hï¿½ï¿½ï¿½Ìï¿½ï¿½						*/
    Sint8 sjflag;     /* offset 0x2, size 0x1 */ /*	ï¿½Oï¿½ï¿½ï¿½ï¿½ï¿½ï¿½İ’è‚³ï¿½ê‚½SJï¿½ï¿½ï¿½Û‚ï¿½			*/
    Sint8 stopnw_flg; /* offset 0x3, size 0x1 */ /*	ï¿½ï¿½~ï¿½vï¿½ï¿½ï¿½tï¿½ï¿½ï¿½O						*/
    ADXSTM stm;       /* offset 0x4, size 0x4 */ /*	ADXSTMï¿½nï¿½ï¿½ï¿½hï¿½ï¿½						*/
    SJ sj;            /* offset 0x8, size 0x4 */ /*	ï¿½Xï¿½gï¿½ï¿½ï¿½[ï¿½ï¿½ï¿½Wï¿½ï¿½ï¿½Cï¿½ï¿½ï¿½g				*/
    Sint32 fnsct;     /* offset 0xC, size 0x4 */ /*	ï¿½tï¿½@ï¿½Cï¿½ï¿½ï¿½Tï¿½Cï¿½Y(ï¿½Zï¿½Nï¿½^)				*/
    Sint32 fsize;     /* offset 0x10, size 0x4 */ /*	ï¿½tï¿½@ï¿½Cï¿½ï¿½ï¿½Tï¿½Cï¿½Y(ï¿½oï¿½Cï¿½g)				*/
    Sint32 skpos;     /* offset 0x14, size 0x4 */ /*	ï¿½Aï¿½Nï¿½Zï¿½Xï¿½|ï¿½Cï¿½ï¿½ï¿½^ï¿½ÌˆÊ’u				*/
    Sint32 rdstpos;   /* offset 0x18, size 0x4 */ /*	ï¿½Ç‚İï¿½ï¿½İŠJï¿½nï¿½Ê’u					*/
    Sint32 rqsct;     /* offset 0x1C, size 0x4 */ /*	ï¿½Ç‚İï¿½ï¿½İ—vï¿½ï¿½ï¿½fï¿½[ï¿½^ï¿½ï¿½(ï¿½Zï¿½Nï¿½^)		*/
    Sint32 rdsct;     /* offset 0x20, size 0x4 */ /*	ï¿½Ç‚İï¿½ï¿½ñ‚¾ƒfï¿½[ï¿½^ï¿½ï¿½(ï¿½Zï¿½Nï¿½^)			*/
    Sint8 *buf;       /* offset 0x24, size 0x4 */ /*	ï¿½oï¿½bï¿½tï¿½@ï¿½ÌƒAï¿½hï¿½ï¿½ï¿½X(ï¿½oï¿½Cï¿½g)			*/
    Sint32 bsize;     /* offset 0x28, size 0x4 */ /*	ï¿½oï¿½bï¿½tï¿½@ï¿½ÌƒTï¿½Cï¿½Y(ï¿½oï¿½Cï¿½g)			*/
    Sint32 rqrdsct;   /* offset 0x2C, size 0x4 */ /*	ï¿½ï¿½ï¿½Û‚É“Ç‚İï¿½ï¿½İ—vï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½(ï¿½Zï¿½Nï¿½^)	*/
    /*	ADXSTM_OpenRange -> ADXSTM_OpenFileRange(1999.8.19)	*/
    Sint32 ofst;      /* offset 0x30, size 0x4 */ /*	ï¿½Ç‚İï¿½ï¿½İƒtï¿½@ï¿½Cï¿½ï¿½ï¿½Ö‚ÌƒIï¿½tï¿½Zï¿½bï¿½g		*/
                 //	Sint8	fname[ADXF_FNAME_MAX];	/*	ï¿½tï¿½@ï¿½Cï¿½ï¿½ï¿½ï¿½							*/
    void *dir;             /* offset 0x34, size 0x4 */ 
    const Char8* unk38;    /* offset 0x38, size 0x4 */ 
    Sint32 unk3C;          /* offset 0x3C, size 0x4 */ 
    Sint32 unk40;          /* offset 0x40, size 0x4 */ 
} ADX_FS;
typedef ADX_FS *ADXF;
#endif

/*	ï¿½pï¿½[ï¿½eï¿½Bï¿½Vï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½		*/
/*	Partition information	*/
#ifndef ADXF_PTINFO_DEFINED
#define ADXF_PTINFO_DEFINED
typedef struct _adxf_ptinfo {
    /* 0x000 */ struct _adxf_ptinfo *next;   /*	ï¿½ï¿½ï¿½Ìƒpï¿½[ï¿½eï¿½Bï¿½Vï¿½ï¿½ï¿½ï¿½(NULL:ï¿½Iï¿½ï¿½ï¿½Wï¿½iï¿½ï¿½)	*/
    /* 0x004 */ Sint32 size;                 /*	ï¿½pï¿½[ï¿½eï¿½Bï¿½Vï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ìˆï¿½Tï¿½Cï¿½Y		*/
    /* 0x008 */ Sint32 nfile;                /*	ï¿½pï¿½[ï¿½eï¿½Bï¿½Vï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ìƒtï¿½@ï¿½Cï¿½ï¿½ï¿½ï¿½		*/
    /* 0x00C */ Uint16 nentry;               /*	ï¿½pï¿½[ï¿½eï¿½Bï¿½Vï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ì“oï¿½^ï¿½tï¿½@ï¿½Cï¿½ï¿½ï¿½ï¿½	*/
    /* 0x00E */ Sint8 type;                  /*	ï¿½Iï¿½ï¿½ï¿½Wï¿½iï¿½ï¿½ï¿½ï¿½ï¿½Ç‹Lï¿½ï¿½ï¿½Ìƒtï¿½ï¿½ï¿½O			*/
    /* 0x00F */ Sint8 rev;                   /*	ï¿½\ï¿½ï¿½Ìˆï¿½							*/
    /* 0x010 */ Sint8 fname[ADXF_FNAME_MAX]; /*	AFSï¿½tï¿½@ï¿½Cï¿½ï¿½ï¿½ï¿½			*/
    /* 0x110 */ void *curdir;                /*	ï¿½Jï¿½ï¿½ï¿½ï¿½ï¿½gï¿½fï¿½Bï¿½ï¿½ï¿½Nï¿½gï¿½ï¿½(NULL:ï¿½wï¿½ï¿½È‚ï¿½)	*/
    /* 0x114 */ Sint32 ofst;                 /*	ï¿½ï¿½ï¿½ï¿½qAFSï¿½tï¿½@ï¿½Cï¿½ï¿½ï¿½p					*/
    /* 0x118 */ Sint32 top;                  /*	ï¿½tï¿½@ï¿½Cï¿½ï¿½ï¿½ï¿½ï¿½Ìæ“ª					*/
} ADXF_PTINFO; /* 0x11C */
#endif

/*	ï¿½Ç‹Lï¿½tï¿½@ï¿½Cï¿½ï¿½ï¿½Ìï¿½ï¿½				*/
/*	Information of postscript file	*/
#ifndef ADXF_ADD_DEFINED
#define ADXF_ADD_DEFINED
typedef struct _adxf_add_info {
    Uint16 flid;  /*	ï¿½tï¿½@ï¿½Cï¿½ï¿½ID							*/
    Uint16 fnsct; /*	ï¿½tï¿½@ï¿½Cï¿½ï¿½ï¿½Tï¿½Cï¿½Y						*/
    Sint32 ofst;  /*	ï¿½Iï¿½tï¿½Zï¿½bï¿½g							*/
} ADXF_ADD_INFO;
#endif

#ifndef ADXF_CMD_HSTRY_DEFINED
#define ADXF_CMD_HSTRY_DEFINED
typedef struct _adxf_cmd_hstry {
    Uint8 cmdid;   /*	ï¿½Rï¿½}ï¿½ï¿½ï¿½h(ï¿½Öï¿½)ID					*/
    Uint8 fg;      /*	ï¿½Öï¿½ï¿½Ì“ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½oï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½tï¿½ï¿½ï¿½O	*/
    Uint16 ncall;  /*	ï¿½Rï¿½}ï¿½ï¿½ï¿½hï¿½ÌŒÄ‚Ñoï¿½ï¿½ï¿½ï¿½				*/
    Sint32 prm[3]; /*	ï¿½Rï¿½}ï¿½ï¿½ï¿½hï¿½pï¿½ï¿½ï¿½ï¿½ï¿½[ï¿½^					*/
} ADXF_CMD_HSTRY;
#endif

