#include "sf33rd/Source/Game/GD3rd.h"
#include "common.h"
#include "sf33rd/AcrSDK/MiddleWare/PS2/CapSndEng/cse.h"
#include "sf33rd/AcrSDK/ps2/flps2debug.h"
#include "sf33rd/AcrSDK/ps2/foundaps2.h"
#include "sf33rd/Source/Common/FileSizeAFS.h"
#include "sf33rd/Source/Game/RAMCNT.h"
#include "sf33rd/Source/Game/WORK_SYS.h"
#include "sf33rd/Source/Game/color3rd.h"
#include "sf33rd/Source/Game/debug/Debug.h"
#include "sf33rd/Source/Game/texgroup.h"
#include "sf33rd/Source/Game/workuser.h"
#include "structs.h"

#include "port/sdk_threads.h"

#include <cri_mw.h>
#include <libcdvd.h>
#include <libgraph.h>

typedef struct {
    // total size: 0x4
    u8 trycount;    // offset 0x0, size 0x1
    u8 spindlctrl;  // offset 0x1, size 0x1
    u8 datapattern; // offset 0x2, size 0x1
    u8 pad;         // offset 0x3, size 0x1
} PS2CDReadMode;

typedef struct {
    // total size: 0x4
    u8 type;  // offset 0x0, size 0x1
    u8 ix;    // offset 0x1, size 0x1
    u8 frre;  // offset 0x2, size 0x1
    u8 kokey; // offset 0x3, size 0x1
} LDREQ_TBL;

typedef void (*LDREQ_Process_Func)(REQ*);

u16 DskDrvErrBe;
u16 DskDrvErrType;
u16 DskDrvErrRetry;
PS2CDReadMode ps2CdReadMode;
s16 plt_req[2]; // size: 0x4, address: 0x579084
u8 ldreq_break;
struct _adx_fs* adxf = NULL;

#if defined(TARGET_PS2)
u8 sf3ptinfo[3352];
#else
u8 sf3ptinfo[3352 + 12];
#endif

REQ q_ldreq[16];      // size: 0x280, address: 0x5E1DD0
u8 ldreq_result[294]; // size: 0x126, address: 0x5E1CA0

const u8 lpr_wrdata[3] = { 0x03, 0xC0, 0x3C }; // size: 0x3, address: 0x51FCF0
const u8 lpc_seldat[2] = { 10, 11 };           // size: 0x2, address: 0x51FCF8
const u8 lpt_seldat[4] = { 3, 4, 5, 0 };       // size: 0x4, address: 0x51FD00

s32 Push_LDREQ_Queue(REQ* ldreq);
void Push_LDREQ_Queue_Metamor();
void q_ldreq_error(REQ* curr);
void disp_ldreq_status();
void Push_LDREQ_Queue_Union(s16 ix);
s32 Check_LDREQ_Queue_Union(s16 ix);

// forward decls
const LDREQ_Process_Func ldreq_process[6];
s8* ldreq_process_name[];
